---
kind: property
id: P:Autodesk.Revit.DB.ThermalAsset.Emissivity
source: html/c16badf0-ec40-68ce-8941-eed39dc872ed.htm
---
# Autodesk.Revit.DB.ThermalAsset.Emissivity Property

The emissivity of the asset.

## Syntax (C#)
```csharp
public double Emissivity { get; set; }
```

## Remarks
Values must be in the range 0 to 1.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for emissivity is out of range